[
  {
    "name": "Voices Unveiled: Empowering Ethnic Minorities",
    "id": "voicesunveiled",
    "description": "While Hong Kong is often perceived as a melting pot of different cultures, there are a number of ethnic minorities which are being discriminated by locals. On 23 June, Uni-verse proudly presents our first ever event: a speaker series on ethnic minorities. Thanks to Inter Cultural Education, we have been fortunate enough to invite three guests from different ethnic backgrounds. They will be sharing their journey from their home countries all the way to Hong Kong.                      The planned takeaways from this speaker series are to broaden participants’ knowledge on different cultures and educate them on the importance of raising awareness over ethnic minorities. Through meaningful interactions, we hope that our participants would realise that ethnic minorities and locals have a lot in common and do not deserve to be discriminated.                                                                            Join us for a educational and relaxing afternoon, where we will be interacting with our guests, playing a range of ice-breakers and enjoying complimentary snacks and drinks.",
    "regLink": "https://forms.gle/AAG8a96L6VyomckG9",
    "infoLink": "https://drive.google.com/file/d/10IHwM0Wu7BHRjacj-wWTSY3Cpk1FTxON/view?usp=sharing",
    "details": [
      "Date: 23 June 2024",
      "Time: 3-5 p.m.",
      "Quota: 20 participants",
      "Location: Room 1208, 12F, Houtex Industrial Building, 16 Hung To Rd, Ngau Tau Kok, Hong Kong"
    ],
    "finished": true,
    "summary": {
      "date": "June 2024",
      "summaryText": "Thanks to Inter Cultural Education, our ethnic minority empowerment workshop was successfully held on 23 June. It was a meaningful session in which participants participated in fun ice breakers and interacted with our guests from all around the world. Through this workshop, we hope that everyone broadened their knowledge on cultures and learnt more about the struggles of ethnic minorities with assimilating into society. We hope that everyone learns to be more accepting towards these ethnic minorities. Only then could we transform the world into a more inclusive and harmonious place for all!"
    }
  }
]
